In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
data = pd.Series(np.random.uniform(size=9),
                index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],
                       [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [5]:
data

a  1    0.188891
   2    0.443585
   3    0.580182
b  1    0.180240
   3    0.657023
c  1    0.120233
   2    0.295062
d  2    0.886757
   3    0.173747
dtype: float64

In [6]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [7]:
data["b"]

1    0.180240
3    0.657023
dtype: float64

In [8]:
data["b":"c"]

b  1    0.180240
   3    0.657023
c  1    0.120233
   2    0.295062
dtype: float64

In [12]:
data.loc[["b","d"]]

b  1    0.180240
   3    0.657023
d  2    0.886757
   3    0.173747
dtype: float64

In [13]:
data.loc[:,2]

a    0.443585
c    0.295062
d    0.886757
dtype: float64

In [14]:
data.unstack()

          1         2         3
a  0.188891  0.443585  0.580182
b  0.180240       NaN  0.657023
c  0.120233  0.295062       NaN
d       NaN  0.886757  0.173747

In [15]:
data.unstack().stack()

a  1    0.188891
   2    0.443585
   3    0.580182
b  1    0.180240
   3    0.657023
c  1    0.120233
   2    0.295062
d  2    0.886757
   3    0.173747
dtype: float64

In [17]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
                     columns=[["Ohic", "Ohic", "Colorado"],
                              ["Green", "Red", "Green"]])

In [18]:
frame

     Ohic     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [19]:
frame.index.names = ["key1", "key2"]

In [20]:
frame.columns.names = ["state", "color"]

In [21]:
frame

state      Ohic     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [22]:
frame.index.nlevels

2

In [24]:
frame["Ohic"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [27]:
pd.MultiIndex.from_arrays([["Ohic", "Ohic", "Colorado"],
                          ["Green", "Red", "Green"]],
                          names=["state", "color"])

MultiIndex([(    'Ohic', 'Green'),
            (    'Ohic',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [28]:
frame.swaplevel("key1", "key2")

state      Ohic     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [29]:
frame.sort_index(level=1)

state      Ohic     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [30]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohic     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [31]:
frame.groupby(level="key2").sum()

state  Ohic     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [32]:
frame.groupby(level="color", axis="columns").sum()

C:\Users\11321\AppData\Local\Temp\ipykernel_2792\775557097.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  frame.groupby(level="color", axis="columns").sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [33]:
frame.T.groupby(level="color").sum().T

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [34]:
frame.T

key1            a     b
key2            1  2  1   2
state    color
Ohic     Green  0  3  6   9
         Red    1  4  7  10
Colorado Green  2  5  8  11

In [35]:
frame = pd.DataFrame({"a": range(7), "b":range(7, 0, -1),
                      "c": ["one", "one", "one", "two", "two",
                            "two", "two"],
                      "d": [0, 1, 2, 0, 1, 2, 3]})

In [36]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [37]:
frame2 = frame.set_index(["c", "d"])

In [38]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [39]:
frame.set_index(["c", "d"], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [40]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1